using System;
using System.Diagnostics;
using PureCloudPlatform.Client.V2.Api;
using PureCloudPlatform.Client.V2.Client;
using PureCloudPlatform.Client.V2.Model;
using PureCloudPlatform.Client.V2.Extensions;
using Newtonsoft.Json;
using System.Linq;

namespace Example
{
    public class PostRoutingWrapupcodesExample
    {
        static void Main(string[] args)
        {
            #region
            string[] s = { "會員申請問題-會員類別說明", "會員申請問題-金流服務介紹", "會員申請問題-物流服務介紹", "會員申請問題-電子發票服務介紹", "會員申請問題-收款服務介紹", "會員申請問題-轉介業務", "會員申請問題-前台會員申請流程", "會員申請問題-特約會員申請流程", "會員申請問題-註冊問題相關", "物流問題-測標問題", "物流問題-寄件/退貨問題", "物流問題-配送進度查詢", "物流問題-物流通知簡訊", "物流問題-7-11寄送異常", "物流問題-全家寄送異常", "物流問題-萊爾富寄送異常", "物流問題-OK寄送異常", "物流問題-黑貓寄送異常", "物流問題-郵局寄送異常", "物流問題-現金支付運費", "物流問題-補收運費", "物流問題-運費保留款", "物流問題-跨境物流相關", "物流問題-理賠問題", "物流問題-門市關轉問題", "物流問題-超過期限未取", "物流問題-包裹誤取", "物流問題-系統操作引導", "物流問題-物流糾紛", "物流問題-異常貨態查詢", "物流問題-宅配到付退回", "物流問題-退款問題", "物流問題-撥款問題", "物流問題-手續費計算/發票", "物流問題-對帳問題", "物流問題-銷毀問題", "系統問題-金流串接設定問題", "系統問題-物流串接設定問題", "系統問題-發票串接設定問題", "系統問題-信用卡交易明細顯示異常", "系統問題-手機版本導致交易異常", "系統問題-廠商管理後台無法登入", "系統問題-通知信異常", "系統問題-無法列印託運單", "系統問題-資安疑慮", "系統問題-超商系統異常", "系統問題-交易系統異常", "系統問題-連線異常", "會員問題-服務申請說明", "會員問題-收款額度", "會員問題-金流合約內容/續約", "會員問題-預付物流費及金流退費", "會員問題-子帳號相關", "會員問題-分期付款服務", "會員問題-確認業務聯絡資訊", "會員問題-變更會員類別/合約商議", "會員問題-停權/刪除/異動會員資料", "會員問題-忘記帳號密碼", "會員問題-系統操作詢問", "會員問題-交易糾紛", "會員問題-帳管費", "會員問題-提領問題", "會員問題-保留款相關", "會員問題-帳戶餘額確認", "會員問題-海外收款服務", "會員問題-提領銀行帳戶相關", "會員問題-手機開啟後台問題", "會員問題-手續費發票開立時間", "電子發票問題-發票申請(合約內容/費用)", "電子發票問題-續約問題", "電子發票問題-B2C發票開立操作", "電子發票問題-字軌設定", "電子發票問題-B2B發票開立操作", "電子發票問題-B2C發票異動(註銷重開/作廢/折讓)", "電子發票問題-批次匯入相關", "電子發票問題-開立失敗相關", "電子發票問題-發票服務設定(通知/信件/簡訊)", "電子發票問題-發票申報問題", "電子發票問題-空白發票問題", "電子發票問題-發票列印/歸戶", "電子發票問題-中獎發票相關", "電子發票問題-B2B發票異動(註銷重開/作廢/折讓)", "抱怨-會員服務", "抱怨-金流服務", "抱怨-物流服務", "抱怨-電子發票服務", "抱怨-業務專員服務", "抱怨-系統服務", "抱怨-交易問題", "身分驗證審核-流程/申請/補件路徑", "身分驗證審核-失敗原因", "身分驗證審核-詢問進度", "銀行驗證審核-流程/申請/補件路徑", "銀行驗證審核-失敗原因", "銀行驗證審核-詢問進度", "收款審核-流程/申請/補件路徑", "收款審核-詢問進度", "收款審核-缺少大門門牌照/大樓外觀", "收款審核-未完成身分/銀行驗證", "收款審核-交易調單暫無法收款", "收款審核-審核不受理", "收款審核-公司文件/證件非最新", "收款審核-缺少進貨單據/庫存照", "收款審核-網頁聯繫資料與會員註冊不符", "收款審核-網頁缺少商品資訊/售價", "收款審核-未提供販售許可證", "收款審核-議約中/資料修改退件", "收款審核-網頁無法開啟", "收款審核-需提供聯徵資訊", "服務問題-實況主設定問題", "服務問題-取消廣告EDM", "服務問題-ECSHOP(收銀台)服務", "服務問題-一址付服務", "服務問題-收款連結", "服務問題-快速刷卡連結", "服務問題-B2B收款連結", "服務問題-文件下載", "服務問題-OMO刷卡機相關", "服務問題-資安聯防", "服務問題-電子票券", "服務問題-POS機相關", "服務問題-Line AI顧問", "銀行/公家機關-銀行調單", "銀行/公家機關-檢警政府公文", "銀行/公家機關-165投單", "銀行/公家機關-國稅局", "銀行/公家機關-銀行通報", "銀行/公家機關-銀行調單", "銀行/公家機關-解保留款", "信用卡-刷卡失敗原因", "信用卡-查詢付款狀態", "信用卡-解圈存", "信用卡-風險控管原因", "信用卡-退刷操作路徑", "信用卡-退刷款返還天期", "信用卡-人工退刷問題", "信用卡-對帳問題", "信用卡-撥款問題", "信用卡-手續費計算/發票", "信用卡-繳錯測試環境", "信用卡-信用卡定期定額查詢/停用", "信用卡-解除綁卡", "ATM/WebATM-重複繳款", "ATM/WebATM-繳錯帳號", "ATM/WebATM-逾期繳款", "ATM/WebATM-繳錯測試環境", "ATM/WebATM-退款問題", "ATM/WebATM-對帳問題", "ATM/WebATM-撥款問題", "ATM/WebATM-手續費計算/發票", "ATM/WebATM-繳錯金額", "超商條/代碼-重複繳款", "超商條/代碼-超商誤刷", "超商條/代碼-繳錯帳號", "超商條/代碼-繳錯測試環境", "超商條/代碼-退款問題", "超商條/代碼-對帳問題", "超商條/代碼-撥款問題", "超商條/代碼-手續費計算/發票", "其它-非綠界業務", "其它-記者來電", "其它-異業合作", "其它-詐騙通報", "其它-建議", "其它-其他", "客服留言-其他", "客服留言-提領失敗", "風管部專用-風管部留言", "綠界行銷活動-迎賓好禮", "綠界行銷活動-TWQR專案", "綠界行銷活動-行銷類通知信", "綠界行銷活動-裕富無卡分期", "綠界行銷活動-綠界官網刷卡好禮", "消費者-發票問題-發票列印/歸戶", "消費者-發票問題-補印發票", "消費者-發票問題-中獎發票相關", "消費者-交易問題-退/換貨/發票開立問題", "消費者-交易問題-超商條/代碼-重複繳款", "消費者-交易問題-虛擬帳號-重複繳款", "消費者-交易問題-虛擬帳號-繳錯金額", "消費者-交易問題-信用卡達風險控管", "消費者-交易問題-信用卡解圈存", "消費者-交易問題-信用卡刷卡失敗", "消費者-交易問題-交易明細/消費商家查詢", "消費者-交易問題-查詢付款結果", "消費者-交易問題-交易糾紛", "消費者-交易問題-無法付款", "消費者-交易問題-分期付款", "消費者-交易問題-定期定額", "消費者-交易問題-退款相關", "消費者-交易問題-解除綁卡", "消費者-交易問題-門市已刷條碼未收款", "消費者-交易問題-盜刷相關", "消費者-物流問題-簡訊發送問題", "消費者-物流問題-正/逆物流配送進度查詢", "消費者-物流問題-7-11配送異常", "消費者-物流問題-全家配送異常", "消費者-物流問題-萊爾富配送異常", "消費者-物流問題-OK配送異常", "消費者-物流問題-黑貓配送異常", "消費者-物流問題-郵局配送異常", "消費者-物流問題-物流糾紛", "消費者-物流問題-門市關轉問題", "消費者-物流問題-包裹誤取" };
            #endregion
            PureCloudRegionHosts region = PureCloudRegionHosts.ap_northeast_1; // Genesys Cloud region
            Configuration.Default.ApiClient.setBasePath(region);

            // Configure OAuth2 access token for authorization: PureCloud OAuth
            // The following example is using the Client Credentials Grant
            var accessTokenInfo = Configuration.Default.ApiClient.PostToken("e22c4a2e-aaf0-4f0a-b700-fd790bd8d3a9", "ow9qQEx5AHFShYSDnD-y48xWWYx3juLWdg_O5xC03J0");

            var apiInstance = new RoutingApi();
            var body = new WrapupCodeRequest(); // WrapupCodeRequest | WrapupCode
            var list = s.Select(e => new WrapupCodeRequest() { Name = e,Division=new WritableStarrableDivision("9bfe5fd9-6d91-4ac1-9e3b-4157b54b74eb") });
            try
            {
                // Create a wrap-up code
                foreach (var row in list)
                {
                    try
                    {
                        WrapupCode result = apiInstance.PostRoutingWrapupcodes(row);
                            Debug.WriteLine(result);
                    }
                    catch { }
                }
            }
            catch (Exception e)
            {
                Debug.Print("Exception when calling Routing.PostRoutingWrapupcodes: " + e.Message);
            }
        }
    }
}